export class HotelInfo {
  public HotelData: {
    "Name": string; // "Танжер",
    "Category": string; // "***",
    "CategoryCode": string; // "3",
    "MinPrice": number; // 0.0,
    "MealType": any; // null,
    "Currency": any; // null,
    "City": string; // "Саки",
    "Country": string; // "Россия",
    "TouristsInfo": any; // null,
    "TourDates": any; // null,
    "Address": string; // "ул. Морская, 2a -  Крым (Саки) Россия",
    "PriceVariants": any; // null,
    "ImageURL": string; // "2282850,2285317,2285628,2285629",
    "ImageURLs"?: string[]; // get urls from id
    "Description": string; // "<DIV><P><SPAN>Санаторий находится на крымском побережье, между известными курортными городами Евпатория и Саки. Прекрасное расположение гостиницы позволяет гостям отдохнуть с пользой для здоровья. г.Саки славится здравницами и целебными природными ресурсами. «Танжер» стоит вблизи чистого пляжа, расстояние до которого 50 метров. Санаторий готов встретить отдыхающих с мая по октябрь. </SPAN><br /><br /><SPAN>Отель представлен двумя современными зданиями с комфортабельными номерами. Вся мебель и ремонт внутри имеют аккуратный вид. Номерной фонд располагает номерами стандарт и полулюкс на два и три места. Дети до 4-х лет заселяются без предоставления отдельного места. Гости могут пользоваться кондиционером, ТВ, холодильником. Практически во всех номерах имеется балкон. В качестве дополнительного места предоставляется еврораскладушка. </SPAN><br /><br /><SPAN>Лечебный корпус с водолечебницей и столовая находится на территории отеля. Питание предоставляется трижды в день и входит в общую стоимость пребывания в санатории. Кафе можно посетить на набережной, до которой всего пару минут ходьбы. Среди объектов инфраструктуры имеются магазины, парковка для автомобилей гостей. Для детей организована детская площадка и детская комната. В лобби гостиницы работает беспроводной интернет (wi-fi). </SPAN><br /><br /><SPAN>Собственный пляж прилегает к территории санатория. Навесы и лежаки предоставляются за дополнительную плату. Пляж полностью песчаный. Посторонние на территорию не допускаются. </SPAN><br /><br /><SPAN>Добраться до гостиницы можно на любом виде транспорта: поездом, автобусом, самолетом до Симферополя. Расстояние от Симферополя до города Саки – 45 километров. Доехать до нужного места можно на электричке или маршрутном такси. </SPAN><br /><br /><SPAN>Гостям отеля иметь при себе паспорт, ваучер, медицинский полис. Прибывшие дети до 14 лет должны предъявить при заселении оригинал свидетельства о рождении, если 14 лет уже исполнилось - паспорт, а также справку об эпидемокружении и прививках. </SPAN><br /><br /><SPAN>Как добраться:</SPAN><br /><SPAN>- поездом от ж/д вокзала г. Симферополь до автовокзала г. Саки, далее маршрутным транспортом до пансионата; </SPAN><br /><SPAN>- самолетом до а/п Симферополя, затем до автовокзала г. Симферополь, далее автобусом или маршрутным такси до г. Саки.</SPAN></P></DIV>",
    "HotelService": any; // null,
    "RoomService": any; // null,
    "SportService": any; // null,
    "BeachService": any; // null,
    "Rayting": any; // null,
    "HotelID": any; // null,
    "AnnulationID": any; // null,
    "Latitude": string; // "45.132202232496077",
    "Longitude": string; // "33.518106937408447",
    "HotelRoom": any[];
    "HotelFacility": any[];
    "HotelContactInfo": {
      "Email": string; // "tesscrimea@ya.ru",
      "Fax": string; // "+73652531222",
      "Address": string; // "ул. Морская, 2a -  Крым (Саки) Россия",
      "Phone": string; // "+7 (495) 204-10-68, +79787160974"
    }
  };
  "RedirectUrl": string; // "",
  "ResultQueryInfo": {
    "ResultsCount": number; // 0,
    "HasError": boolean; // false,
    "Info": any[];
    "CacheStorageTimeEnd": any; // null,
    "RefreshPeriod": any; // null,
    "DelFromCacheDateTime": any; // null,
    "UserMessages": string; // "",
    "UserMessagesHtml": string; // ""
  }
}
